<?php

namespace Database\Seeders;

use App\Models\Category;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class LectureSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // first category = Планини
        $category = Category::find(1);
        $category->lectures()->createMany(collect([
            [
                'title' => 'Шар Планина',
                'paragraph' => 'Шар Планина или скратено Шара — еден од најголемите и највисоките планински масиви во Македонија.
                                 Сместена е во северозападниот дел на земјата, на границите со Косово и Албанија.
                                 Голем дел од планинскиот масив во Македонија е сместен во најновиот национален парк „Шар Планина“,
                                 прогласен на 30 јуни 2021 година.
                                 Шар Планина се наоѓа во северозападниот дел на Македонија. Шарпланинскиот масив се протега во правец
                                 североисток - запад – југозапад во должина од 76 км. Започнува од реката Лепенец и Качаничката Клисура
                                 на североисток, на исток границата е определена со Полошката котлина, на југозапад Штировичката Река
                                 и изворите на Радика, на југ изворот на реката Вардар – Вруток, а на запад - надвор од територијата
                                 на Македонија.',
                'image' => 'https://i.ibb.co/8YQY5Sb/image.jpg'
            ],
            [
                'title' => 'Кораб',
                'paragraph' => 'Кораб — планина во Западна Македонија, на границата со Албанија. На неа се наоѓа највисоката точка
                                (врв) во Р. Македонија — Голем Кораб, со висина од 2.764 метри надморска височина. Кораб е планинска
                                верига која се протега на правец југ-север.
                                Традиционалното меѓународно искачување на Голем Кораб се одржува во почетокот на септември секоја
                                година по повод 8 септември денот на независноста на Македонија.
                                Поради уникатните природни карактеристики делот на планината кој влегува во границите на Македонија,
                                во 1952 година е признаен како дел од националниот парк „Маврово“.',
                'image' => 'https://i.ibb.co/LYDdXLn/image.jpg'
            ],
            [
                'title' => 'Баба',
                'paragraph' => 'Баба или Баба Планина — планина што се наоѓа во југозападниот дел на Република Македонија,
                                со највисокиот врв Пелистер (2.601 м), сместена неколку километри западно од Битола.Легендата за настанувањето
                                на името на Баба Планина е запишана од диовчанецот Сотир Петревски „Автобиографија“ во машинопис.
                                Често се нарекува и Пелистер (старомакедонски: Пелистера?·и - гулаб), иако тоа е само името на нејзиниот највисок врв.
                                Според површината која ја зафаќа (436 км2) таа е тринаесетта најголема, а според височината (Пелистер, 2.601 м)
                                трета највисока планина во Република Македонија.
                                Во 1948 година, поради особените природни убавини, историското и научното значење на шумите и шумските
                                предели на планината Баба, еден нејзин дел со површина од 12 500 хектари, е прогласен за национален парк.',
                'image' => 'https://i.ibb.co/NjSdNgg/image.jpg'
            ],
            [
                'title' => 'Јакупица',
                'paragraph' => 'Јакупица или Мокра Планина — планински масив во Централна Македонија. Составена е од повеќе планински делови: Караџица,
                                Даутица, Голешница, Китка, Мумџица, Салакова Планина и Осој. Планинскиот масив е настанат во терциерот, со раседнување.
                                Јадрото е составено од гнајс и од кристалести шкрилци, а над нив се наоѓаат дебели слоеви на мезозојски варовници и доломити.
                                На планината се наоѓаат траги од ледената епоха, претставени преку циркови (две езера), валови и морени. Јакупица е
                                богата со разновидна флора и фауна, пасишта, извори - врела и др. Највисок и најзабележлив врв е Солунска Глава,
                                висок 2.540 метри.
                                Релјефот е пресекуван од бројни чисти и брзи планински реки. Големи области се покриени со букови, дабови и игнолисни шуми.
                                Исто така, постојат очигледни траги на исконски глацијација од делувалниот период. Во последно време голем број на институции
                                имаат дадено предлог Јакупица, како и целиот масив Мокра Планина да станат национален парк',
                'image' => 'https://i.ibb.co/71gJnTm/image.jpg'
            ]
        ]));

        // Езера
        $category = Category::find(2);
        $category->lectures()->createMany(collect([
            [
                'title' => 'Дојранско Езеро',
                'paragraph' => 'Вистинското место на кое може да го почувствувате климатсткото влијание од Медитеранот е околината на Дојранскo Езеро,
                                на југоисточниот дел од Македонија. Отвореноста кон југот и ниската надморска височина (148 метри) причинуваат средна годишна температура
                                на водата да биде околу 15-18 степени. Додека во лето дури до 25-27 степени, така што може да помислите дека се наоѓате во води на некое
                                тропско езеро. Вистински медитерански амбиент на бреговите на Дојранско Езеро.
                                Дојранското Езеро, со површина од 43,1 km2, е најмалото тектонско езеро во земјава. Воедно и најплитко – со максимална длабочина
                                од 10 метри – и претставува реликтен остаток од некогашното плеоценско Пеонско Езеро. Покрај западниот брег на Дојранско Езеро се наоѓаат
                                двете рибарски населби Стар и Нов Дојран, кои се повеќе се доближуваат една до друга, правејќи природен спој. Летата во Дојран се жешки и суви,
                                а зимите се благи и влажни. Богатството од ендемски видови алги што живеат во Дојранско Езеро ќе ви овозможи да се надишете јод,
                                а не пропуштајте на себе да нанесете малку од лековитата дојранска кал.',
                'image' => 'https://i.ibb.co/dMgskBC/image.jpg'
            ],
            [
                'title' => 'Охридско Езеро',
                'paragraph' => 'Еден од најубавите подароци на природата во Европа е Охридско Езеро и неговата околина. Доволно е само да го видите како мирува од далечина,
                                да ги чуете брановите и да се загледате во бескрајното синило за да се вљубите во него. Езерото е лоцирано во југозападниот дел на Македонија,
                                старо е меѓу 4 и 10 милиони години, и со тоа е најстаро на нашиот континент. На прв поглед може да ве збуни со својата големина, па да помислите
                                дека е море. Површината изнесува 358,2 km2.
                                Охридско Езеро го карактеризираат подводни врутоци и извори што се наоѓаат по должината на источниот и јужниот брег, па затоа водата е неверојатно
                                бистра. Проѕирност на некои места достигнува дури 22 метра. Најголем дел од површинските извори се наоѓаат кај манастир Св. Наум, а во непосредна
                                близина на градот Охрид е еден од најпознатите извори – Студенчишта, познат како Билјанини Извори. Најголемата длабочина измерена на Охридско Езеро
                                е меѓу селата Пештани и Трпејца се наоѓа на околу пет километри од езерскиот брег.',
                'image' => 'https://i.ibb.co/m6QgmFf/image.jpg'
            ],
            [
                'title' => 'Преспанско Езеро',
                'paragraph' => 'Преспанската област се одликува со многу сончеви денови, а крајбрежјето на Преспанско Езеро има неколку убави песочни плажи.
                                Постојано сте опкружени со планини со бујна вегетација. Сето тоа заедно со бистрата езерска вода нема да ве остават рамнодуши
                                и постојано ќе ве канат на капење и релаксација. За развојот на летниот туризам многу ќе помогнe културното наследство и разни
                                објекти и прекрасните видици и интересни локации, како и посебните организирани тури со водич и придружник ос чуварска служба од
                                Маркова нога се до с. Коњско и островот „Голем Град“. Заокружено со планини од сите страни, Преспанското езеро маѓепсува со својата
                                изворедна убавина. Додека врвовите на Галичица се покриени со првиот снег, долу во равницата, на брегот на езерото, сеуште има ружи
                                и есенски цвеќиња.
                                Во Преспанско Езеро се наоѓа и единствениот остров во Македонија – Голем град. Овој остров е долг 750 метри, а широк 450 метри.
                                Претставува природна реткост и резерват од ретки билки и различни растителен и животински свет. Познат е и под името Змиски остров,
                                затоа што изобилува со водени змии белоушки, но и со отровниот поскок, кој може да се сретне во горниот дел од островот. До островот се
                                приоѓа со чамец од две места, каде што има мали пажи и пукнатини во карпите.',
                'image' => 'https://i.ibb.co/3pcMMKb/image.jpg'
            ]
        ]));

        // Реки
        $category = Category::find(3);
        $category->lectures()->createMany(collect([
            [
                'title' => 'Река Вардар',
                'paragraph' => 'Вардар е најголемата река во Република Македонија. Долга е 388 км и нејзиниот речен слив опфаќа површина од приближно 25.000 км².
                                Вардар има навистина композитна речна долина поради редењето на клисури и котлини една по друга долж нејзиното течение. Извира во Вруток,
                                неколку километри југозападно од Гостивар во северозападниот дел на Република Македонија. Денес Вруток како туристичка атракција
                                преставува една модерна селска населба со огромен потенцијал за еко туризам. Продолжува да тече низ градот Гостивар и котлината Полог,
                                каде се влеваат неколку притоки: Лакавица, Маздрача, Пена, Бистрица, Ракита. Потоа, преку Дервенската клисура навлегува во Скопската котлина
                                каде прима вода од Лепенец, Треска, Пчиња и Маркова Река и минува низ Скопје.
                                Минувајќи низ Таорската Клисура каде се влева Кадина Река, навлегува во малата Велешка котлина и минува низ Велес. Овде се вливаат реките
                                Тополка и Бабуна. Потоа преку Велешката клисура навлегува во Тиквешката котлина каде се вливаат двете нејзини најголеми притоки Црна Река
                                од десна и Брегалница од лева страна. Навлегува во познатата Демиркаписка клисура, а преку нејзе во Гевгелиско-валандовската котлина каде што
                                ја преминува грчката граница, минува низ Циганската клисура. Течејќи низ Солунското поле се влева во Егејското море западно од Солун во Егејска Македонија.',
                'image' => 'https://i.ibb.co/Fw3SgQ7/image.jpg'
            ],
            [
                'title' => 'Струмица (река)',
                'paragraph' => 'Струмица е десна притока на реката Струма, и има должината од 114 км, од кои 81 км од нејзиното течение се во Македонија, а 33 во Бугарија.
                                Вкупната површина на сливот изнесува 1465 км2, со просечен пад од 18‰. Реката ги одводнува јужните падини на планините Плачковица и Огражден,
                                североисточните падини на планината Смрдеш и северните делови на планината Беласица, како и Радовишкото и Струмичкото поле и југозападниот дел
                                на Петричко-санданската котлина.
                                Река Струмица извира под името „Стара Река“ на планината Плачковица, на надморска височина од 1346 м. До градот Радовиш тече на југ по длабока долина,
                                потоа кај градот излегува од планината, свртува југоисточно и влегува во Радовишкото поле, а потоа на околу 10 км - кај Струмичкото поле постепенно
                                свртува на исток држејќи ја оваа насока се до нејзиниот влив. По граничниот премин Ново Село навлегува во бугарска територија откако тече во широка
                                и плитка долина со многу меандри. Минува на околу 2 км северно од градот Петрич и се влева од десно во реката Струма, на 93 м надморска височина,
                                на 2 км североисточно од селото Митино.',
                'image' => 'https://i.ibb.co/MS6QwDt/image.jpg'
            ],
            [
                'title' => 'Река Црн Дрим',
                'paragraph' => 'Црн Дрим е река во Македонија што истекува и која припаѓа на јадранскиот слив.  Реката извира во близина на манастирот Свети Наум, минува низ
                                Охридското Езеро и излегува од него кај градот Струга на надморска височина од 695 метри. Оваа река ја напушта Македонија во близина на градот Дебар
                                на 476 метри надморска височина. Од 2013 година 6 мај се одбележува како „Ден на реката Црн Дрим“ чија цел е подигање на јавната свест за заштита на
                                сливот на реката Дрим.
                                Реката Црн Дрим го добила своето име благодарение на силикатните, ендемски алги со црна боја. Истите можете да ги забележите на дното на водата како
                                треперат занесени во својот подводен танц. Во водите на Црн Дрим живеат најразлични видови на риби, како на пример крапот, кленот, јагулата, мрената
                                и други. Охридската јагула со милениуми мигрирала од Охридското Езеро до Саргасовото Море заради размножување. Во втората половина на XX век со изградбата
                                на двете брани на македонскиот дел и четири на албанскиот дел комплетно бил блокиран патот на јагулата. Браните се проблем и за други видови риби кои
                                од Јадранското Море некогаш патувале до Охридското Езеро.',
                'image' => 'https://i.ibb.co/6804GXp/image.jpg'
            ]
        ]));

        // Градови
        $category = Category::find(4);
        $category->lectures()->createMany(collect([
            [
                'title' => 'Скопје',
                'paragraph' => 'Главен град на Македонија е градот Скопје. Тој е и најголем град во земјата и воедно претставува административно-политички, стопански, културен и образовно-научен центар.
                                Се наоѓа во северниот дел на државата, поделен на два дела од реката Вардар. Градот во текот на своето постоење, во зависност од историските прилики, бил именуван
                                со различни имиња, а неговото античкото име е Скупи.
                                Места од интерес за туристички разгледувања се: Камениот мост на реката Вардар е симбол на Скопје. Бил преработен во XV век и претставува врска помеѓу новиот и стариот дел.
                                Тврдина Кале - Првите ѕидини биле изградени на почетокот на VI век. Калето доминира над левиот брег на реката Вардар со поглед на стариот дел на градот.
                                Воин на коњ, споменикот, е композиција од повеќе елементи. Бронзениот споменик на Александар има висина од 14,5 метри и тежи 30 тони. Во средината на десет метри високиот столб
                                е поставен воинот Александар II Македонски, познат како Александар Велики, со поглед кон изгревот на сонцето.
                                Плоштадот Македонија во Скопје, поцелосно е оформен во периодот меѓу двете светски војни, поточно од 1920 година до 1940 година. Лоциран е во контекст на Камениот Мост,
                                како основна врска на градските целини од левата и десната страна на Вардар.',
                'image' => 'https://i.ibb.co/qnHZ4FW/image.jpg'
            ],
            [
                'title' => 'Охрид',
                'paragraph' => 'Охрид — град во југозападниот дел на Македонија, на североисточното крајбрежје на Охридското Езеро, кое по градот го носи и своето име. Охрид и Охридското Езеро
                                се едни од главните туристички места во Македонија. Поради големиот број на цркви и манастири, градот е познат како Балкански и Европски Ерусалим. Охрид е познат
                                и како „град на светлината“ што претставува буквален превод на неговото старо име, Лихнид. Охридскиот регион е вклучен во светското населдство на УНЕСКО.
                                Современиот Охрид е наследник на античкиот Лихнид.
                                Според податоците, градот прв пат се споменува 2.400 години пред новата ера. Лихнид се наоѓал на патот Виа Егнација, наjстарата и наjзначаjната римска
                                сообраќаjница на Балканот. Бригијците и Енхелеjците го сочинуваат наjстарото население, кое може според името да се идентификува во пошироката област на Охридското Езеро.
                                Бригиjците се исто што и Фригиjците. По Третата македонска воjна против кралот Персеј, Лихнид станува главна римска база во северните области на Македониjа.
                                Тоа е времето кога за него наjмногу се слуша. Последната вест за Лихнид е веста за неговото разурнување. Во еден земјотрес, коj според историските извори се случил
                                на 29 и 30 мај 526 година, настрадале повеќе десетици илjади лица во Лихнид. Потоа градот повеќе не се споменува во историските извори. Охридската област во краjот на VI век
                                била изложена на масовна словенска колонизациjа. Охридската област до 30-тите години на VII век била целосно колонизирана од словенското племе Берзити.
                                Лихнид оттогаш го добил името Охрид.',
                'image' => 'https://i.ibb.co/y488h2c/image.jpg'
            ],
            [
                'title' => 'Кратово',
                'paragraph' => 'Кратово е лоциран во североисточниот регион на Република Македонија и е сместено во југозападното подножје на Осоговските Планини во долината на Кратовска Река,
                                лева притока на Крива Река. Со едноставна комуникативна врска Кратово на северозапад се поврзува со Куманово и Крива Паланка, а на југ со Пробиштип. Денес
                                општина Кратово е административно- управен, просветен и здравствен центар во своето гравитациско подрачје, има околу 7.000 жители, а во стопанството водечка улога
                                имаат рударството и индустријата.
                                Кратово е град со најголем број средновековни кули во Македонија, вкупно 17. Дванаесет се лоцирани на левата страна од Кратово, а пет на десната. Само шест од нив се сочувани,
                                додека другите се мошне оштетени. Најголем дел од кулите настрадале за време на Карпошовото востание. Златкова кула е најстара и најбогата, изградена во 1365 година.
                                Симиќева кула е најзначајната, највисоката и најубавата кула во Кратово, изградена во 1370 година од тогашниот владетел на Кратово, велико достојникот Костадин Дејанов.
                                На кулата во 1921 година е поставен градски часовник, така што денес е позната како градска саат-кула.
                                Градот на кулите и мостови е домаќин и организатор на еден од најзабавните фестивали на музика и култура, фестивалот “Златни денови”. Кратово успева да се воспостави како еден од најпознатите градови,
                                каде што постои совршена синергија на забава, култура и историја. Овој фестивал е одлична можност за секој да се запознае со историјата на прекрасното Кратово и да си ја
                                исполни душата со прекрасна музика, кратовски гурмански специјалитети и одлична забава.',
                'image' => 'https://i.ibb.co/F5yCq3M/image.jpg'
            ]
        ]));

    }
}
